#include "DialogRenderWindow.h"

#include "LogUtil.h"
#include "MathUtil.h"
#include "MemoryUtil.h"
#include "WindowsUtil.h"

#include "NIAVObject.h"
#include "NIBound.h"
#include "NICamera.h"
#include "NICollisionSwitch.h"
#include "NIGeometry.h"
#include "NIMatrix33.h"
#include "NINode.h"
#include "NIPick.h"

#include "CSCell.h"
#include "CSDataHandler.h"
#include "CSGameFile.h"
#include "CSLandTexture.h"
#include "CSRecordHandler.h"
#include "CSReference.h"
#include "CSStatic.h"

#include "Settings.h"
#include "RenderWindowSceneGraphController.h"
#include "RenderWindowSelectionData.h"
#include "RenderWindowWidgets.h"

namespace se::cs::dialog::render_window {
	static WORD lastRenderWindowPosX = 0;
	static WORD lastRenderWindowPosY = 0;

	using gObjectMove = memory::ExternalGlobal<float, 0x6CE9B4>;
	using gObjectRotate = memory::ExternalGlobal<float, 0x6CE9B0>;

	using gCameraPan = memory::ExternalGlobal<float, 0x6CE9C0>;
	using gCameraRotate = memory::ExternalGlobal<float, 0x6CE9B8>;
	using gCameraZoom = memory::ExternalGlobal<float, 0x6CE9BC>;

	using gSnapGrid = memory::ExternalGlobal<int, 0x6CE9A8>;
	using gSnapAngleInDegrees = memory::ExternalGlobal<int, 0x6CE9AC>;
	using gCumulativeRotationValues = memory::ExternalGlobal<NI::Vector3, 0x6CF760>;

	using gRenderWindowPick = memory::ExternalGlobal<NI::Pick, 0x6CF528>;

	using gCurrentCell = memory::ExternalGlobal<Cell*, 0x6CF7B8>;

	using gIsHoldingV = memory::ExternalGlobal<bool, 0x6CF789>;
	using gIsHoldingX = memory::ExternalGlobal<bool, 0x6CF786>;
	using gIsHoldingY = memory::ExternalGlobal<bool, 0x6CF787>;
	using gIsHoldingZ = memory::ExternalGlobal<bool, 0x6CF788>;
	using gIsScaling = memory::ExternalGlobal<bool, 0x6CF785>;

	using gRenderNextFrame = memory::ExternalGlobal<bool, 0x6CF78D>;

	namespace RenderControlFlags {
		enum RenderControlFlags : DWORD {
			SnapToGrid = 0x1,
			SnapToAngle = 0x2,
			AllowRenderWindowCellLoads = 0x4,
			SkipInitialCellLoad = 0x10,
		};
	}
	using gRenderControlFlags = memory::ExternalGlobal<DWORD, 0x6CE9A4>;
	using gAutoSaveTime = memory::ExternalGlobal<int, 0x6CEA38>;

	// Convenience function to see if X, Y, or Z are held down.
	bool isHoldingAxisKey() {
		return gIsHoldingX::get() || gIsHoldingY::get() || gIsHoldingZ::get();
	}

	bool isGridSnapping() {
		return gRenderControlFlags::get() & RenderControlFlags::SnapToGrid;
	}

	bool isAngleSnapping() {
		return gRenderControlFlags::get() & RenderControlFlags::SnapToAngle;
	}

	struct NetImmerseInstance {
		struct VirtualTable {
			void* dtor; // 0x0
			void* setRegistryKey; // 0x4
			void* setWindowWidth; // 0x8
			void* setWindowHeight; // 0xC
			void* setBitDepth; // 0x10
			void* setBackBuffers; // 0x14
			void* setMultisampleEnable; // 0x18
			void* setMultisamples; // 0x1C
			void* setFullScreen; // 0x20
			void(__thiscall* setPixelShaderEnabled)(NetImmerseInstance*, bool); // 0x24
			void* setStencil; // 0x28
			void* setMipmap; // 0x2C
			void* setMipmapSkipLevel; // 0x30
			void* setHardwareTL; // 0x34
			void* setMultipass; // 0x38
			void* setVertexProcessing; // 0x3C
			void* setSwapEffect; // 0x40
			void* setRefreshRate; // 0x44
			void* setPresentInterval; // 0x48
			void* setAdapterID; // 0x4C
			void(__thiscall* setGamma)(NetImmerseInstance*, float); // 0x50
			void* readSettings; // 0x54
			void* writeSettings; // 0x58
			void* createRenderer; // 0x5C
			void* createRendererFromSettings; // 0x60
		};
		VirtualTable* vTable; // 0x0
		const char* ownerString; // 0x4
		int windowWidth; // 0x8
		int windowHeight; // 0xC
		int screenDepth; // 0x10
		int backBuffers; // 0x14
		int multiSamples; // 0x18
		bool fullscreen; // 0x1C
		bool stencil; // 0x1D
		bool mipmap; // 0x1E
		bool hardware; // 0x1F
		bool pixelShader; // 0x20
		bool multiPass; // 0x21
		bool screenShotsEnabled; // 0x22
		int vertexProcessing; // 0x24
		int swapEffect; // 0x28
		int refreshRate; // 0x2C
		int adapter; // 0x30
		int mipmapSkipLevel; // 0x34
		int presentationInterval; // 0x38
		float gamma; // 0x3C
		NI::Vector3 unknown_0x40;
		NI::Pointer<NI::Node> node; // 0x4C
		NI::Renderer* renderer; // 0x50
		int unknown_0x54;
		HWND parentWindow; // 0x58
		int unknown_0x5C;
		int unknown_0x60;
	};
	static_assert(sizeof(NetImmerseInstance) == 0x64, "CS::NetImmerseInstance failed size validation");
	static_assert(sizeof(NetImmerseInstance::VirtualTable) == 0x64, "CS::NetImmerseInstance's virtual table failed size validation");

	//
	// Patch: Use world rotation values unless ALT is held.
	//

	const auto TES3_CS_OriginalRotationLogic = reinterpret_cast<bool(__cdecl*)(void*, SelectionData::Target*, int, SelectionData::RotationAxis)>(0x4652D0);
	bool __cdecl Patch_ReplaceRotationLogic(void* unknown1, SelectionData::Target* firstTarget, int relativeMouseDelta, SelectionData::RotationAxis rotationAxis) {
		using windows::isKeyDown;

		// Allow holding ALT modifier to do vanilla behavior.
		bool useWorldAxisRotation = settings.render_window.use_world_axis_rotations_by_default;
		if (isKeyDown(VK_MENU)) {
			useWorldAxisRotation = !useWorldAxisRotation;
		}

		if (!useWorldAxisRotation) {
